## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route.cloud_asset_inventory[0] will be created
  + resource "aws_route" "cloud_asset_inventory" {
      + destination_cidr_block    = "10.0.8.0/22"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-00333f6ce0076750d"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_route.cloud_asset_inventory[1] will be created
  + resource "aws_route" "cloud_asset_inventory" {
      + destination_cidr_block    = "10.0.8.0/22"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-01372a1de847d4c8e"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_route.cloud_asset_inventory[2] will be created
  + resource "aws_route" "cloud_asset_inventory" {
      + destination_cidr_block    = "10.0.8.0/22"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0363d487060ca8d8e"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_vpc_peering_connection.cloud_asset_inventory will be created
  + resource "aws_vpc_peering_connection" "cloud_asset_inventory" {
      + accept_status = (known after apply)
      + auto_accept   = false
      + id            = (known after apply)
      + peer_owner_id = "794722365809"
      + peer_region   = "ca-central-1"
      + peer_vpc_id   = "vpc-00a43e63b345ba0ce"
      + tags          = {
          + "Side" = "Requester"
        }
      + tags_all      = {
          + "Side" = "Requester"
        }
      + vpc_id        = "vpc-09a32d3e2e932fa09"

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = false
          + allow_remote_vpc_dns_resolution  = true
          + allow_vpc_to_remote_classic_link = false
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_peering_connection.cloud_asset_inventory"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
